from typing import NewType


LineRef = NewType("LineRef", int)
OperatorRef = NewType("OperatorRef", int)
SiriRideId = NewType("SiriRideId", int)
SiriRideStopId = NewType("SiriRideStopId", int)
SiriStopId = NewType("SiriStopId", int)
LocationId = NewType("LocationId", int)
SiriStopCode = NewType("SiriStopCode", int)

Longtitude = NewType("Longtitude", float)
Latitute = NewType("Latitute", float)

K = 5

START_HOUR = 7
END_HOUR = 11
# END_HOUR = 8

OPERATOR_REFS = {
    "METROPOLIN": 15,
}

LINE_REFS = {"8_to_cinema": 29094}

SIRI_STOPS_TO_NAME = {
    6752: "מסוף קדמה",
    15487: "שבי ציון ירמיהו",
    20518: "שבי ציון שאר ישוב",
    22510: "שבי ציון נהרדעא",
    16520: "דוב הוז שמואל הנגיד",
    12927: "בית שמאי מרגנית",
    13750: "בית שמאי שמואל הנגיד",
    22907: "בית שמאי המלכים",
    5175: "שבטי ישראל סמטת ויצו",
    2966: "שבטי ישראל בית השואבה",
    21104: "הרב קוק הזוהר",
    18141: "הרב קוק הרב ריינס",
    21974: "המלכים עגנון",
    2391: "טרומפלדור המלכים",
    4883: "משטרה טרומפלדור",
    6509: "חטב קלמן אוסישקין",
    2965: "אוסישקין הנוטר",
    5174: "שדרות ביאליק עירייה",
    6750: "סוקולוב סנטר סוקולוב",
    1846: "סוקולוב זורבבל",
    32082: "השרף סוקולוב",
    32083: "השרף לבונה",
    4884: "צומת גלילות בסיס צבאי",
}

SIRI_STOPS_TO_CODE = {
    16520: 20521,
    4883: 26819,
    4884: 26744,
    2965: 26828,
    2966: 26841,
    20518: 26867,
    13750: 26854,
    1846: 20224,
    5174: 26831,
    5175: 26838,
    32082: 20293,
    32083: 20326,
    21974: 26825,
    2391: 26824,
    18141: 26844,
    6750: 26876,
    15487: 20369,
    6752: 26863,
    6509: 26826,
    22510: 26865,
    21104: 26839,
    22907: 26849,
    12927: 26857,
}


STOP_LOCATIONS = {
    16520: (34.857996, 32.134092),
    4883: (34.84333, 32.136843),
    4884: (34.816839, 32.143364),
    2965: (34.842781, 32.140708),
    2966: (34.852584, 32.130483),
    20518: (34.860439, 32.135365),
    13750: (34.855609, 32.131804),
    1846: (34.836339, 32.141002),
    5174: (34.842834, 32.14471),
    5175: (34.850161, 32.129707),
    32082: (34.834694, 32.138303),
    32083: (34.82878, 32.139205),
    21974: (34.848883, 32.135883),
    2391: (34.84554, 32.135243),
    18141: (34.850378, 32.134306),
    6750: (34.838269, 32.145502),
    15487: (34.862637, 32.133202),
    6752: (34.860132, 32.129639),
    6509: (34.841423, 32.137595),
    22510: (34.858984, 32.134528),
    21104: (34.849508, 32.131088),
    22907: (34.853534, 32.13147),
    12927: (34.856266, 32.133557),
}


SIRI_STOP_ORDER = [
    6752,
    15487,
    20518,
    22510,
    16520,
    12927,
    13750,
    22907,
    2966,
    5175,
    21104,
    18141,
    21974,
    2391,
    4883,
    6509,
    2965,
    5174,
    6750,
    1846,
    32082,
    32083,
    4884,
]
