from typing import NewType


LineRef = NewType("LineRef", int)
OperatorRef = NewType("OperatorRef", int)
SiriRideId = NewType("SiriRideId", int)
SiriRideStopId = NewType("SiriRideStopId", int)
SiriStopId = NewType("SiriStopId", int)
LocationId = NewType("LocationId", int)

K = 5

START_HOUR = 7
END_HOUR = 11
# END_HOUR = 8

OPERATOR_REFS = {
    "METROPOLIN": 15,
}

LINE_REFS = {"8_to_cinema": 29094}

SIRI_STOPS_TO_NAME = {
    "16520": "דוב הוז שמואל הנגיד",
    "4883": "משטרה טרומפלדור",
    "4884": "צומת גלילות בסיס צבאי",
    "2965": "אוסישקין הנוטר",
    "2966": "שבטי ישראל בית השואבה",
    "20518": "שבי ציון שאר ישוב",
    "13750": "בית שמאי שמואל הנגיד",
    "1846": "סוקולוב זורבבל",
    "5174": "שדרות ביאליק עירייה",
    "5175": "שבטי ישראל סמטת ויצו",
    "32082": "השרף סוקולוב",
    "32083": "השרף לבונה",
    "21974": "המלכים עגנון",
    "2391": "טרומפלדור המלכים",
    "18141": "הרב קוק הרב ריינס",
    "6750": "סוקולוב סנטר סוקולוב",
    "15487": "שבי ציון ירמיהו",
    "6752": "מסוף קדמה",
    "19046": "חטב קלמן אוסישקין",
    "6509": "חטב קלמן אוסישקין",
    "22510": "שבי ציון נהרדעא",
    "21104": "הרב קוק הזוהר",
    "22907": "בית שמאי ההמלכים",
    "12927": "בית שמאי מרגנית",
}

SIRI_STOPS_TO_CODE = {
    "16520": "20521",
    "4883": "26819",
    "4884": "26744",
    "2965": "26828",
    "2966": "26841",
    "20518": "26867",
    "13750": "26854",
    "1846": "20224",
    "5174": "26831",
    "5175": "26838",
    "32082": "20293",
    "32083": "20326",
    "21974": "26825",
    "2391": "26824",
    "18141": "26844",
    "6750": "26876",
    "15487": "20369",
    "6752": "26863",
    "19046": "28626",
    "6509": "26826",
    "22510": "26865",
    "21104": "26839",
    "22907": "26849",
    "12927": "26857",
}
